Tekla Open API Reference for Tekla Structures 2025
PourBreak.Select Method
 Selects the drawing pour break from the current drawing database.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public override bool Select()
Public Overrides Function Select As Boolean
Return Value
Type: Boolean
True on success.
See Also
Reference
PourBreak Class
Tekla.Structures.Drawing Namespace